alert-acton-update/src/test/resources/events/ALERT.Recommender.IssueRecommendation.xml

<?xml version="1.0" encoding="UTF-8"?><s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2" xmlns:wsa="http://www.w3.org/2005/08/addressing">
  <s:Header>Header</s:Header>
  <s:Body>
    <wsnt:Notify>
      <wsnt:NotificationMessage>
        <wsnt:Topic>ALERT.Recommender.IssueRecommendation</wsnt:Topic>
        <wsnt:ProducerReference>
          <wsa:Address>http://www.alert-project.eu/socrates</wsa:Address>
        </wsnt:ProducerReference>
        <wsnt:Message>
          <ns1:event xmlns:ns1="http://www.alert-project.eu/" xmlns:o="http://www.alert-project.eu/ontoevents-mdservice" xmlns:r="http://www.alert-project.eu/rawevents-forum" xmlns:r1="http://www.alert-project.eu/rawevents-mailinglist" xmlns:r2="http://www.alert-project.eu/rawevents-wiki" xmlns:s="http://www.alert-project.eu/strevents-kesi" xmlns:sm="http://www.alert-project.eu/stardom" xmlns:s1="http://www.alert-project.eu/strevents-keui" xmlns:sc="http://www.alert-project.eu/socrates" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.alert-project.eu/alert-root.xsd"  >
            <ns1:head>
              <ns1:sender>SOCRATES</ns1:sender>
              <ns1:timestamp>1331676396932</ns1:timestamp>
              <ns1:sequencenumber>570749432</ns1:sequencenumber>
            </ns1:head>
            <ns1:payload>
              <ns1:meta>
                <ns1:startTime>1331676396932</ns1:startTime>
                <ns1:endTime>1331676396937</ns1:endTime>
                <ns1:eventName>ALERT.Recommender.IssueRecommendation</ns1:eventName>
                <ns1:eventId>1818516212</ns1:eventId>
                <ns1:eventType>Reply</ns1:eventType>
              </ns1:meta>
              <ns1:eventData>
              	<p:patternId>a965F68ECF48A4D14BCC755481FD1E288</p:patternId>
                <sc:issues>
                  <sc:issue>
                    <sc:id>1010</sc:id>
                    <o:bug>owl#1</o:bug>
                  </sc:issue>
                  <sc:issue>
                    <sc:id>2050</sc:id>
                    <o:bug>owl#2</o:bug>
                  </sc:issue>
                  <sc:issue>
                    <sc:id>2030</sc:id>
                    <o:bug>owl#3</o:bug>
                  </sc:issue>
                  <sc:issue>
                    <sc:id>2040</sc:id>
                    <o:bug>owl#4</o:bug>
                  </sc:issue>
                </sc:issues>
              </ns1:eventData>
            </ns1:payload>
          </ns1:event>
        </wsnt:Message>
      </wsnt:NotificationMessage>
    </wsnt:Notify>
  </s:Body>
</s:Envelope>